app/serializers/meditation_serializer.rb

  def listens
    object.plays.size
---
SELECT COUNT(*) FROM "plays" WHERE "plays"."meditation_id" = $1  [["meditation_id", 22]]