app/serializers/student_serializer.rb

  def total_listens
     object.plays.length
---
SELECT "plays".* FROM "plays" WHERE "plays"."student_id" = $1  [["student_id", 1]]
SELECT SUM("plays"."length") FROM "plays" WHERE "plays"."student_id" = $1  [["student_id", 1]]

   def recent_plays
     plays = object.plays.order(created_at: :desc).limit(5)
     recent_plays = plays.collect {|p| PlaySerializer.new(p)} unless plays.length == 0
---
SELECT "plays".* FROM "plays" WHERE "plays"."student_id" = $1 LIMIT $2  [["student_id", 1], ["LIMIT", 5]]

   def most_donated_teacher
      if object.donations.length == 0
         return ""
      else
     teacher = Teacher.find(object.donations.group_by {|d| d.teacher_id}.transform_values {|v| v.count}.max_by {|k,v| v}[0])
---
SELECT "teachers".* FROM "teachers" WHERE "teachers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]