app/serializers/teacher_serializer.rb

SELECT SUM(listens) FROM "meditations" WHERE "meditations"."teacher_id" = $1  [["teacher_id", 1]]
SELECT "meditations".* FROM "meditations" WHERE "meditations"."teacher_id" = $1  [["teacher_id", 1]]
SELECT "plays".* FROM "plays" WHERE "plays"."meditation_id" = $1  [["meditation_id", 22]]
---
  def total_listens
    object.meditations.map {|m| m.plays.length}.reduce(:+)