app/controllers/chats_controller.rb

SELECT "chats".* FROM "chats" WHERE "chats"."teacher_id" = $1 LIMIT $2  [["teacher_id", 2], ["LIMIT", 1]]
---
    def find_by_teacher
     chats = Chat.all.find_by(teacher_id: params[:id])