app/controllers/follows_controller.rb

INSERT INTO "follows" ("student_id", "teacher_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["student_id", 1], ["teacher_id", 1], ["created_at", "2021-08-13 14:19:03.683788"], ["updated_at", "2021-08-13 14:19:03.683788"]]
---
    def create
       follow = Follow.create!(follow_params)

SELECT "follows".* FROM "follows" WHERE "follows"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "follows" WHERE "follows"."id" = $1  [["id", 1]]
---
    def destroy
    follow = Follow.find(params[:id])
    follow.destroy