app/controllers/log_in_controller.rb

    def create
    if params[:type] == 'student'
     user = Student.find_by(email: params[:email])
    else
        user = Teacher.find_by(email: params[:email])
---
SELECT "students".* FROM "students" WHERE "students"."email" = $1 LIMIT $2  [["email", "gg@g.com"], ["LIMIT", 1]]
SELECT "teachers".* FROM "teachers" WHERE "teachers"."email" = $1 LIMIT $2  [["email", "g@g.com"], ["LIMIT", 1]]