app/controllers/meditations_controller.rb

SELECT "meditations".* FROM "meditations"
---
    def index
      render json: Meditation.all

SELECT "meditations".* FROM "meditations" WHERE "meditations"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
---
    def show
        meditation = Meditation.find(params[:id])

INSERT INTO "meditations" ("med_type", "title", "description", "est_length", "teacher_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
   def create
      meditation = Meditation.create!(med_params)

SELECT "meditations".* FROM "meditations" WHERE "meditations"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
UPDATE "meditations" SET "description" = $1, "updated_at" = $2 WHERE "meditations"."id" = $3  [["description", "Did this finally do it?"], ["updated_at", "2021-08-11 20:12:04.720792"], ["id", 11]]
---
   def update
      med = Meditation.find(params[:id])
      med.update!(update_params)

SELECT "meditations".* FROM "meditations" WHERE "meditations"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
SELECT "teachers".* FROM "teachers" WHERE "teachers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "meditations" WHERE "meditations"."id" = $1  [["id", 12]]
---
   def destroy
     med = Meditation.find(params[:id])
     currentL = med.teacher.meditations.length
     last_med = med.teacher.meditations.order(created_at: :desc).slice(1)
     med.destroy