app/controllers/messages_controller.rb

INSERT INTO "chats" ("title", "student_id", "teacher_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "asdkjasdkl"], ["student_id", 1], ["teacher_id", 2], ["created_at", "2021-08-13 16:46:55.672678"], ["updated_at", "2021-08-13 16:46:55.672678"]]
INSERT INTO "messages" ("content", "student_id", "teacher_id", "chat_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["content", "Come on"], ["student_id", 1], ["teacher_id", 2], ["chat_id", 5], ["created_at", "2021-08-13 16:46:55.687043"], ["updated_at", "2021-08-13 16:46:55.687043"]]
---
    def create
      if params[:chat_id] == nil
        chat = Chat.create!(chat_params)
        message = Message.create!(message_params)

SELECT "chats".* FROM "chats" ORDER BY "chats"."id" DESC LIMIT $1  [["LIMIT", 1]]
---
    def message_params
        if params[:chat_id] == nil
            params.permit(:student_id, :teacher_id, :content, :username).merge({chat_id: Chat.last.id})