app/controllers/plays_controller.rb

INSERT INTO "plays" ("student_id", "meditation_id", "length", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["student_id", 1], ["meditation_id", 9], ["length", 5], ["created_at", "2021-08-11 22:10:17.207671"], ["updated_at", "2021-08-11 22:10:17.207671"]]
---
    def create
     play = Play.create!(play_params)