app/controllers/students_controller.rb

    def update
        student = Student.find(params[:id])
        student.update!(update_params)
---
SELECT "students".* FROM "students" WHERE "students"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "students" SET "name" = $1, "updated_at" = $2 WHERE "students"."id" = $3  [["name", "StudentGrant"], ["updated_at", "2021-08-11 19:30:36.746659"], ["id", 1]]