app/controllers/teachers_controller.rb

SELECT "teachers".* FROM "teachers"
---
    def index
     render json: Teacher.all

SELECT "teachers".* FROM "teachers" WHERE "teachers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
      teacher = Teacher.find(params[:id])

SELECT "teachers".* FROM "teachers" WHERE "teachers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "teachers" SET "image_url" = $1, "updated_at" = $2 WHERE "teachers"."id" = $3  [["image_url", "https://www.sharonsalzberg.com/wp-content/uploads/2010/09/SharonSalzbergHeadshot2015-SquareBW-Small.jpg"], ["updated_at", "2021-08-11 19:25:18.709188"], ["id", 1]]
---
    def update
      teacher = Teacher.find(params[:id])
      teacher.update!(update_params)