app/controllers/users_controller.rb

    def create
      if (params[:type] == "student")
       user = Student.create!(user_params)
      else
       user = Teacher.create!(user_params)
---
INSERT INTO "students" ("name", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
INSERT INTO "teachers" ("email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["email", "asdasd"], ["password_digest", "$2a$12$j.6i42iRGqNHZ/XcVFLXLeOrwaEshiC1nJMOm44H0iV8UZqpg2.IG"], ["created_at", "2021-08-09 20:30:39.355330"], ["updated_at", "2021-08-09 20:30:39.355330"]]